[
{"description": "Introduces curriculum, learning techniques, time management and career opportunities in Computer Science. Includes presentations from alumni and others with relevant educational and professional experience.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              Requisites: Restricted to students with 0-26 credits (Freshmen) Computer Science (CSEN-BS, CSEN-ADL, CSCI-BA or CSCI-ADL) majors only.", "prerequisites": "Requisites: Restricted to students with 0-26 credits (Freshmen) Computer Science (CSEN-BS, CSEN-ADL, CSCI-BA or CSCI-ADL) majors only.", "number": "1000", "credits": "(1)", "department": "CSCI", "name": ") Computer Science as a Field of Work and Study"},
{"description": "Intended to create a foundation for operating systems research or advanced professional practice. Examines the design and implementation of a number of research and commercial operating systems and their components, system organization and structure, threads, communication and synchronization, virtual memory, distribution, file systems, security and authentication, availability, and Internet services. Department enforced prereq., equivalent undergraduate coursework in operating systems and computer architecture, or instructor consent. Same as ECEN 5573. Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5573", "credits": "(3)", "department": "CSCI", "name": ") Advanced Operating Systems"},
{"department": "CSCI", "credits": "(4)", "number": "1220", "name": ") Virtual Worlds: An Introduction to Computer Science"},
{"department": "CSCI", "credits": "(3)", "number": "1240", "name": ") The Computational World"},
{"description": "Teaches techniques for writing computer programs in higher level programming languages to solve problems of interest in a range of application domains. This class is intended for students with little to no experience in computing or programming. Credit not granted for this class and CSCI 1310 or CSCI 1320 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).", "prerequisites": "Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).", "number": "1300", "credits": "(4)", "department": "CSCI", "name": ") Computer Science 1: Starting Computing"},
{"description": "Introduces computing systems, software, and methods used to solve large-scale problems in science and engineering. Students use high-performance workstations and a supercomputer. First course in a two-semester sequence. Same as CSCI 4576. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5576", "credits": "(4)", "department": "CSCI", "name": ") High-Performance Scientific Computing"},
{"description": "Provides a broad-scope treatment of important concepts in the design and implementation of high-performance computer systems. Discusses important issues in the pipelining of a machine and the design of cache memory systems. Also studies current and historically important computer architectures. Recommended prereq., CSCI 4593 or instructor consent required. Same as ECEN 5593. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5593", "credits": "(3)", "department": "CSCI", "name": ") Advanced Computer Architecture"},
{"description": "Highlights computer arithmetic, solution of linear systems, least-squares approximations, nonlinear algebraic equations, interpolation, and quadrature. Recommended prereqs., CSCI 3656 and three semesters of calculus, or equivalent. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5606", "credits": "(3)", "department": "CSCI", "name": ") Principles of Numerical Computation"},
{"description": "Interdisciplinary introduction to cognitive science, examining ideas from cognitive psychology, philosophy, education, and linguistics via computational modeling and psychological experimentation. Includes philosophy of mind; learning; categorization; vision and mental imagery; consciousness; problem solving; decision making, and game-theory; language processing; connectionism. Department enforced prereqs., graduate standing or at least one course at the 3000-level or higher in Computer Science, Linguistics, Philosophy or Psychology. No background in Computer Science will be presumed. Same as EDUC 6504, LING 6200, PHIL 6310, and PSYC 6200. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "6402", "credits": "(3)", "department": "CSCI", "name": ") Issues and Methods in Cognitive Science"},
{"description": "Provides opportunities for independent study at the upper-division undergraduate level. Students work on a small research problem or tutor lower-division computer science students. Requisites: Requires prerequisite course of CSCI 1300 or CSCI 1310 or CSCI 1320 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 1300 or CSCI 1310 or CSCI 1320 (all minimum grade C-).", "number": "4900", "credits": "(1-3)", "department": "CSCI", "name": ") Upper Division, Undergraduate Level Independent Study"},
{"description": "Introduces UNIX (Linux) system administration and related topics, including trouble-shooting system and network problems, hardware and software configuration and installation, basic scripting, and security aspects of Internet hosts. Students build a Linux server from the ground up, using provided computing resources, and must maintain and secure the server themselves.  Recommended prereq., CSCI 3308. Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).", "number": "4113", "credits": "(3)", "department": "CSCI", "name": ") Unix System Administration"},
{"description": "Intended for students with some prior experience in programming and basic knowledge of variables, conditionals, and loops. Teaches techniques for writing computer programs in higher level programming languages to solve problems of interest in a range of application domains. Credit not granted for this course and CSCI 1300  or CSCI 1320 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).", "prerequisites": "Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).", "number": "1310", "credits": "(4)", "department": "CSCI", "name": ") Computer Science 1: Starting Computing - Experienced"},
{"description": "Intended for students with no prior experience in programming. Class outcomes and goals are identical to CSCI 1300, but uses problems and tools from Engineering. Teaching techniques for writing computer programs in higher level programming languages to solve problems of interest in Engineering and other domains. Credit not granted for this course and CSCI 1300 or CSCI 1310 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-). Restricted to College of Engineering or Computer Science (CSEN) or Pre-Engineering Arts and Science (PREN) majors only.", "prerequisites": "Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-). Restricted to College of Engineering or Computer Science (CSEN) or Pre-Engineering Arts and Science (PREN) majors only.", "number": "1320", "credits": "(4)", "department": "CSCI", "name": ") Computer Science 1: Starting Computing-Engineering Applications"},
{"description": "Studies data abstractions (e.g., stacks, queues, lists, trees) and their representation techniques (e.g., linking, arrays). Introduces concepts used in algorithm design and analysis including criteria for selecting data structures to fit their applications. Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 or ECEN 1030 or ECEN 1310 and APPM 1345 or APPM 1350 or MATH 1300 or MATH 1310 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 or ECEN 1030 or ECEN 1310 and APPM 1345 or APPM 1350 or MATH 1300 or MATH 1310 (all minimum grade C-).", "number": "2270", "credits": "(4)", "department": "CSCI", "name": ") Computer Science 2: Data Structures"},
{"description": "Presents topics and techniques critical to the management of software product development, including estimating, planning, quality, tracking, reporting, team organization, people management, and legal issues. Gives special attention to problems unique to software projects. Recommended prereqs., ECEN 4583, CSCI 5548 and 4318, or equivalent industrial experience. Same as ECEN 5603 and EMEN 5031. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5608", "credits": "(3)", "department": "CSCI", "name": ") Software Project Management"},
{"description": "Trains students to build computer systems that learn from experience. Includes the three main subfields: supervised learning, reinforcement learning and unsupervised learning. Emphasizes practical and theoretical understanding of the most widely used algorithms (neural networks, decision trees, support vector machines, Q-learning). Covers connections to data mining and statistical modeling. A strong foundation in probability, statistics, multivariate calculus, and linear algebra is highly recommended. Requisites: Requires prerequisite courses of CSCI 2400 and CSCI 3104 (all minimum grade C). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2400 and CSCI 3104 (all minimum grade C). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5622", "credits": "(3)", "department": "CSCI", "name": ") Machine Learning"},
{"description": "Focuses on finite difference solution for partial differential equations, methods of SoR, ADI, conjugate gradients, finite element method, nonlinear problems, and applications. Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.only.", "number": "5636", "credits": "(3)", "department": "CSCI", "name": ") Numerical Solution of Partial Differential Equations"},
{"description": "Offers direct and iterative solutions of linear systems. Also covers eigen value and eigenvector calculations, error analysis, and reduction by orthogonal transformation. A sound knowledge of basic linear algebra, experience with numerical computation, and programming experience is required. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5646", "credits": "(3)", "department": "CSCI", "name": ") Numerical Linear Algebra"},
{"description": "Topics include matching and network flows, matroids, computational geometry, parallel computation (PRAM, hypercube, mesh). Also includes Vlsi, database theory, distributed computation, cryptography, robotics, scheduling, probabilistic algorithms, approximation algorithms, average case, and amortized analysis, time permitting. Requisites: Requires prerequisite course of CSCI 5454 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5454 (minimum grade B). Restricted to graduate students only.", "number": "6454", "credits": "(3)", "department": "CSCI", "name": ") Advanced Algorithms"},
{"description": "Covers advanced theoretical and practical topics in machine learning and latest developments in the field. Students conduct original research, either applied or theoretical, and present their results. Recommended prereq., CSCI 5622 or instructor consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "6622", "credits": "(3)", "department": "CSCI", "name": ") Advanced Machine Learning"},
{"description": "Looks at modern computational methods for solution of unconstrained optimization problems, nonlinear leastsquares, and systems of nonlinear equations. Techniques for building algorithms to solve problems with special structure. Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to graduate students only.", "number": "6676", "credits": "(3)", "department": "CSCI", "name": ") Numerical Methods for Unconstrained Optimization"},
{"description": "Provides an opportunity for senior computer science majors to conduct exploratory research in computer science. Department enforced restriction, successful completion of a minimum of 36 credit hours of Computer Science coursework and WRTG 3030. May be repeated up to 8 total credit hours. Requisites: Requires a prerequisite or corequisite course of CSCI 3100 (minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior).", "prerequisites": "Requisites: Requires a prerequisite or corequisite course of CSCI 3100 (minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior).", "number": "4950", "credits": "(2-4)", "department": "CSCI", "name": ") Senior Thesis"},
{"description": "Provides an opportunity for senior Computer Science majors to complete an honors thesis by conducting exploratory research in computer science. Department enforced requisites: successful completion of a minimum of 36 credit hours of Computer Science Foundation, Track Foundation, Track Core and Computer Science electives and a writing requirement. May be repeated up to 8 total credit hours. Requisites: Restricted to students with 87-180 credits (Senior, Fifth Year Senior).", "prerequisites": "Requisites: Restricted to students with 87-180 credits (Senior, Fifth Year Senior).", "number": "4960", "credits": "(2-4)", "department": "CSCI", "name": ") Computer Science Honors Thesis"},
{"description": "Covers two-level and multilevel minimization, optimization via expert systems, algebraic and Boolean decomposition, layout methodologies, state assignment, encoding and minimization, silicon compilation. Recommended prereqs., ECEN 2703 and general proficiency in discrete mathematics and programming. Same as ECEN 5139. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5135", "credits": "(3)", "department": "CSCI", "name": ") Computer-Aided Verification"},
{"description": "Studies design, analysis, and implementation of computer graphics techniques. Topics include interactive techniques, 2D and 3D viewing, clipping, segmentation, translation, rotation, and projection. Also involves removal of hidden edges, shading, and color.  Knowledge of basic linear algebra is required.  Same as CSCI 5229. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "number": "4229", "credits": "(3)", "department": "CSCI", "name": ") Computer Graphics"},
{"description": "Studies design, analysis and implementation of advanced computer graphics techniques. Topics include shaders, using the GPU for high performance computing, graphics programming on embedded devices such as mobile phones; advanced graphics techniques such as ray tracing. Same as CSCI 5239. Requisites: Requires prerequisite course of CSCI 4229 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 4229 (minimum grade C-).", "number": "4239", "credits": "(3)", "department": "CSCI", "name": ") Advanced Computer Graphics"},
{"description": "Explores the \"great works\" of computer science through intensive reading and discussion. Readings include works by Babbage, Turing, Von Neumann, Goedel, Shannon and Minsky, among others. Same as CSCI 5250. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).", "prerequisites": "Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).", "number": "4250", "credits": "(3)", "department": "CSCI", "name": ") Computer Science: the Canon"},
{"description": "Covers the primary problem solving strategies, methods and tools needed for data-intensive programs using large collections of computers typically called \"warehouse scale\" or \"data-center scale\" computers. The course examines methods and algorithms for processing data-intensive applications, methods for deploying and managing large collections of computers in an on-demand infrastructure and issues of large-scale computer system design. Recommended prerequisite: CSCI 4273/5273. Same as CSCI 5253. Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C). Restricted to students with 57-180 credits (Juniors or Seniors).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C). Restricted to students with 57-180 credits (Juniors or Seniors).", "number": "4253", "credits": "(3)", "department": "CSCI", "name": ") Datacenter Scale Computing - Methods, Systems and Techniques"},
{"description": "Covers how programs are represented and executed by modern computers, including low-level machine representations of programs and data, an understanding of how computer components and the memory hierarchy influence performance. Requisites: Requires prerequisite course of CSCI 2270 and a prereq or coreq course of CSCI 2824 or MATH 2001 or ECEN 2703 or APPM 3170 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2270 and a prereq or coreq course of CSCI 2824 or MATH 2001 or ECEN 2703 or APPM 3170 (minimum grade C-).", "number": "2400", "credits": "(4)", "department": "CSCI", "name": ") Computer Systems"},
{"description": "Introduces the fundamentals of linear algebra in the context of computer science applications.  Includes vector spaces, matrices, linear systems, and eigenvalues.  Includes the basics of floating point computation and numerical linear algebra. Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 (all minimum grade C-).", "number": "2820", "credits": "(3)", "department": "CSCI", "name": ") Linear Algebra with Computer Science Applications"},
{"description": "Covers foundational materials for computer science that is often assumed in advanced courses. Topics include set theory, Boolean algebra, functions and relations, graphs, propositional and predicate calculus, proofs, mathematical induction, recurrence relations, combinatorics, discrete probability. Focuses on examples based on diverse applications of computer science. Requisites: Requires prerequisite or corequisite course of CSCI 2270 and a prerequisite course of MATH 1300 or MATH 1310 or APPM 1350 or APPM 1345 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite or corequisite course of CSCI 2270 and a prerequisite course of MATH 1300 or MATH 1310 or APPM 1350 or APPM 1345 (minimum grade C-).", "number": "2824", "credits": "(3)", "department": "CSCI", "name": ") Discrete Structures"},
{"department": "CSCI", "credits": "(1-3)", "number": "2830", "name": ") Special Topics in Computer Science"},
{"description": "Presents algorithms, simplex, and modifications. Examines theory---duality and complementary slackness. Involves network flow algorithms. Introduces integer programming. Department enforced prereq., linear algebra. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5654", "credits": "(3)", "department": "CSCI", "name": ") Linear Programming"},
{"description": "Examines systems that span multiple autonomous computers. Topics include system structuring techniques, scalability, heterogeneity, fault tolerance, load sharing, distributed file and information systems, naming, directory services, resource discovery, resource and network management, security, privacy, ethics, and social issues. Recommended prereqs., CSCI 5573 or a course in computer networks. Same as ECEN 5673. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5673", "credits": "(3)", "department": "CSCI", "name": ") Distributed Systems"},
{"description": "Explores context-free languages: pumping lemma and variants, closure properties, and decision properties. Involves parsing algorithms, including general and special languages, e.g., LR. Additional topics chosen by instructor. Recommended prereq., CSCI 5444 or instructor consent required. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5714", "credits": "(3)", "department": "CSCI", "name": ") Formal Languages"},
{"description": "Covers computational methods for constrained optimization. Topics include basic theory, methods for quadratic programming, active set strategies for linear constraints, and penalty and successive quadratic programming methods for nonlinearly constrained problems. Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5606 (minimum grade B). Restricted to graduate students only.", "number": "6686", "credits": "(3)", "department": "CSCI", "name": ") Numerical Methods for Constrained Optimization"},
{"description": "Students seeking the master of engineering degree must complete a creative investigation project, including a written report, supervised by a member of the graduate faculty. Department enforced prereq., completion of 21 hours towards the ME degree. Requisites: Restricted to graduate student Computer Sciences (CSEN) students only.", "prerequisites": "Requisites: Restricted to graduate student Computer Sciences (CSEN) students only.", "number": "6800", "credits": "(1-6)", "department": "CSCI", "name": ") Master of Engineering Project"},
{"department": "CSCI", "credits": "(1)", "number": "6810", "name": ") Seminar in Computational Biology"},
{"description": "For students who need to be registered for the purpose of taking the master's comprehensive exam and who are not otherwise registered. Credit does not count toward degree requirements. Graded on a pass/fail basis.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "6940", "credits": "(1)", "department": "CSCI", "name": ") Master's Degree Candidacy"},
{"description": "Studies design, analysis, and implementation of computer graphics techniques. Topics include interactive techniques, 2D and 3D viewing, clipping, segmentation, translation, rotation, and projection. Also involves removal of hidden edges, shading, and color.  Knowledge of basic linear algebra is required.  Same as CSCI 4229. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5229", "credits": "(3)", "department": "CSCI", "name": ") Computer Graphics"},
{"description": "Studies design, analysis and implementation of advanced computer graphics techniques. Topics include shaders, using the GPU for high performance computing, graphics programming on embedded devices such as mobile phones; advanced graphics techniques such as ray tracing. Same as CSCI 4239. Requisites: Requires prerequisite course of CSCI 5229 (minimum grade B). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5229 (minimum grade B). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5239", "credits": "(3)", "department": "CSCI", "name": ") Advanced Computer Graphics"},
{"description": "Explores the \"great works\" of computer science through intensive reading and discussion. Readings include works by Babbage, Turing, Von Neumann, Goedel, Shannon and Minsky, among others. CSCI 5250 does not count toward breadth requirement for Computer Science MS/ME degree. Same as CSCI 4250. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5250", "credits": "(3)", "department": "CSCI", "name": ") Computer Science: the Canon"},
{"description": "Covers the primary problem solving strategies, methods and tools needed for data-intensive programs using large collections of computers typically called \"warehouse scale\" or \"data-center scale\" computers. The course examines methods and algorithms for processing data-intensive applications, methods for deploying and managing large collections of computers in an on-demand infrastructure and issues of large-scale computer system design. Recommended prerequisite: CSCI 4273/5273. Same as CSCI 4253. Requisites: Restricted to graduate student Computer Sciences (CSEN) students only.", "prerequisites": "Requisites: Restricted to graduate student Computer Sciences (CSEN) students only.", "number": "5253", "credits": "(3)", "department": "CSCI", "name": ") Datacenter Scale Computing - Methods, Systems and Techniques"},
{"description": "Focuses on design and implementation of network programs and systems, including topics in network protocols, file transfer, client-server computing, remote procedure call, and other contemporary network system design and programming techniques. Familiarity with C and Unix is required. Same as CSCI 5273 and ECEN 5273. Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C-).", "number": "4273", "credits": "(3)", "department": "CSCI", "name": ") Network Systems"},
{"description": "Exposes students to current research topics in the field of robotics and provides hands-on experience in solving a grand challenge program. Same as CSCI 5302. Requisites: Requires prerequisite course of CSCI 3302 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3302 (minimum grade C-).", "number": "4302", "credits": "(3)", "department": "CSCI", "name": ") Advanced Robotics"},
{"description": "Advanced practicum in which students design, implement, document and test software systems for use in industry, non-profits, government and research institutions. Also offers extensive experience in oral and written communication throughout the development process.  Department enforced restriction, successful completion of a minimum of 36 credit hours of Computer Science coursework and approved WRTG are required to enroll. Recommended prereq., CSCI 4448. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "number": "4308", "credits": "(4)", "department": "CSCI", "name": ") Software Engineering Project 1"},
{"department": "CSCI", "credits": "(1-3)", "number": "2900", "name": ") Lower Division, Undergraduate Level Independent Study"},
{"description": "Introduces the practice and research of human-centered computing, including the evolution of human-computer interaction to its forms today and the techniques of user-centered design. The course will survey topics that include social computing; tangible computing; mobility; and more. It will cover computing in society at large with respect to domains such as health, education, assistive technology, emergency response, and environment. Requisites: Restricted to students with 27-180 credits (Sophomores, Juniors or Seniors) only.", "prerequisites": "Requisites: Restricted to students with 27-180 credits (Sophomores, Juniors or Seniors) only.", "number": "3002", "credits": "(3)", "department": "CSCI", "name": ") HCC Foundations/User-Centered Design and Development 1"},
{"description": "Provides students with an understanding of the professional, ethical, legal and social issues and responsibilities of software developers, as well as providing them with the ability to analyze the local and global impacts of computing on individuals, organizations and society. Students may not receive credit for both this course and CSCI 4308, 4328 or 4338. Requisites: Requires prerequisite course of CSCI 3308 (minimum grade C-). Restricted to Computer Science (CSEN-BS, CSEN-ADL, CSCI-BA, CSCI-ADL) majors only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3308 (minimum grade C-). Restricted to Computer Science (CSEN-BS, CSEN-ADL, CSCI-BA, CSCI-ADL) majors only.", "number": "3100", "credits": "(1)", "department": "CSCI", "name": ") Software and Society"},
{"description": "Explores algorithms that can extract information about the world from images or sequences of images. Topics covered include: imaging models and camera calibration, early vision (filters, edges, texture, stereo, optical flow), mid-level vision (segmentation, tracking), vision-based control, and object recognition. Recommended prereq., probability, multivariate calculus, and linear algebra. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5722", "credits": "(3)", "department": "CSCI", "name": ") Computer Vision"},
{"description": "Presents a broad range of system measurement and modeling techniques, emphasizing applications to computer systems. Topics include system measurement, work load characterization, and analysis of data; design of experiments; simulation; and queuing theory and queuing network models. Same as CSCI 4753. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5753", "credits": "(3)", "department": "CSCI", "name": ") Computer Performance Modeling"},
{"description": "Develops a firm understanding of the general principles of computer animation. Lectures cover the creation of models, materials, textures, surfaces, and lighting. Path and key frame animation, particle dynamics, and rendering are introduced. Students are assigned a number of animation tutorials to carry out. Same as CSCI 4809 and ATLS 4809/5809. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5809", "credits": "(3)", "department": "CSCI", "name": ") Computer Animation"},
{"description": "Provides an advanced treatment of basic database concepts. Recommended prereqs., CSCI 3287 and 3753. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5817", "credits": "(3)", "department": "CSCI", "name": ") Database Systems"},
{"description": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "6950", "credits": "(1-6)", "department": "CSCI", "name": ") Master's Thesis"},
{"description": "Covers research topics of current interest in computer science that do not fall into a standard subarea. May be repeated up to 8 total credit hours. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7000", "credits": "(1-4)", "department": "CSCI", "name": ") Current Topics in Computer Science"},
{"description": "Topics selected by instructor. Possible topics are system design, measurement and evaluation, simulation, mathematical modeling, and parallelism. Requisites: Requires prerequisite course of CSCI 5573 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5573 (minimum grade B). Restricted to graduate students only.", "number": "7123", "credits": "(3)", "department": "CSCI", "name": ") Topics in Operating Systems"},
{"description": "Topics selected by instructor. Possible topics are syntax, semantics, metacompilers, compiler design, and translator writing systems. Department consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7135", "credits": "(3)", "department": "CSCI", "name": ") Topics in Programming Languages"},
{"description": "Discuss basic convex analysis (convex sets, functions and optimization problems), optimization theory (linear, quadratic, semidefinite and geometric programming; optimality conditions and duality theory), some optimization algorithms (descent methods and interior-point methods), basic applications (in signal processing, control, communications, networks, statistics, machine learning, circuit design and mechanical engineering, etc.), and some advanced topics (distributed decomposition, exact convex relaxation, parsimonious recovery). Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5254", "credits": "(3)", "department": "CSCI", "name": ") Convex Optimization and Its Applications"},
{"description": "Focuses on design and implementation of network programs and systems, including topics in network protocols, file transfer, client-server computing, remote procedure call, and other contemporary network system design and programming techniques. Familiarity with C and Unix is required. Same as CSCI 4273 and ECEN 5273. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5273", "credits": "(3)", "department": "CSCI", "name": ") Network Systems"},
{"description": "Exposes students to current research topics in the field of robotics and provides hands-on experience in solving a grand challenge program.  Recommended prereq., CSCI 3302 or instructor consent required. Same as CSCI 4302. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5302", "credits": "(3)", "department": "CSCI", "name": ") Advanced Robotics"},
{"description": "Surveys molecular biology and combinatorial algorithms used to understand DNA, RNA, and proteins. Students work in groups to define and tackle meaningful biological problems and learn to collaborate effectively with scientists in other disciplines. Recommended prereq., comfort with mathematics and/or programming experience, and more advanced understanding (upper undergraduate level) of any relevant discipline. Same as CSCI 5314, MCDB 4314 and MCDB 5314. Requisites: Requires a prerequisite course of CSCI 3104 (minimum grade C-).", "prerequisites": "Requisites: Requires a prerequisite course of CSCI 3104 (minimum grade C-).", "number": "4314", "credits": "(3)", "department": "CSCI", "name": ") Algorithms for Molecular Biology"},
{"description": "Second semester of an advanced practicum in computer science. Students must take CSCI 4308 and 4318 contiguously as the project spans the entire academic year. Requisites: Requires prerequisite course of CSCI 4308 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 4308 (minimum grade C-).", "number": "4318", "credits": "(4)", "department": "CSCI", "name": ") Software Engineering Project 2"},
{"description": "Review software project management and discuss the latest approaches, methodologies and standards of software development. Learn to develop software quality, documentation, testing, and prototype goals. Study project risk management and cost estimation approaches. Experience mentoring Senior Software Project Team. This course is intended for professional software developers. Department consent required. See Senior Project Director for permission. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "number": "4328", "credits": "(4)", "department": "CSCI", "name": ") Software Project Management and Mentoring"},
{"description": "Covers advanced data structures, computational geometry, cryptography, dynamic programming, greedy algorithms, divide-and-conquer, graph algorithms (e.g., depth-first search), network algorithms (e.g., shortest paths), approximation algorithms. Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 and one of the following:  CSCI 2824, ECEN 2703, APPM 3170 or MATH 2001 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 and one of the following:  CSCI 2824, ECEN 2703, APPM 3170 or MATH 2001 (all minimum grade C-).", "number": "3104", "credits": "(4)", "department": "CSCI", "name": ") Algorithms"},
{"department": "CSCI", "credits": "(1-3)", "number": "3112", "name": ") Human-Centered Computing Professional Development"},
{"description": "Study fundamental concepts on which programming of languages are based, and execution models supporting them. Topics include values, variables, bindings, type systems, control structures, exceptions, concurrency, and modularity. Learn how to select a language and to adapt to a new language. Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or ECEN 2703 or APPM 3170 or MATH 2001 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or ECEN 2703 or APPM 3170 or MATH 2001 (all minimum grade C-).", "number": "3155", "credits": "(4)", "department": "CSCI", "name": ") Principles of Programming Languages"},
{"description": "Introduces a set of modeling techniques that have become a mainstay of modern artificial intelligence, cognitive science and machine learning research. These models provide essential tools for interpreting the statistical structure of large data sets and for explaining how intelligent agents analyze the vast amount of experience that accumulates through interactions with an unfamiliar environment. Recommended prerequisite: undergraduate course in probability and statistics. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5822", "credits": "(3)", "department": "CSCI", "name": ") Probabilistic Models of Human and Machine Learning"},
{"description": "Provides an introduction to software engineering concepts and techniques. Topics include the history of software engineering, fundamental software engineering principles and theory, software life cycles, software testing, and the design and implementation of concurrent and large-scale software systems. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5828", "credits": "(3)", "department": "CSCI", "name": ") Foundations of Software Engineering"},
{"description": "Explores the field of natural language processing as it is concerned with the theoretical and practical issues that arise in getting computers to perform useful and interesting tasks with natural language. Covers the problems of understanding complex language phenomena and building practical programs. Same as LING 5832. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5832", "credits": "(3)", "department": "CSCI", "name": ") Natural Language Processing"},
{"description": "Develops the skills and practices necessary to apply user-centered approaches to software requirements analysis, and the design and evaluation of computer applications. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5839", "credits": "(3)", "department": "CSCI", "name": ") User-Centered Design and Development 1"},
{"description": "Topics selected by instructor. Possible topics are online systems, multiprocessing, microprogramming, architecture, data communications, and computing networks. May be repeated up to 6 total credit hours. Department consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7143", "credits": "(3)", "department": "CSCI", "name": ") Topics in Computer Systems"},
{"description": "Selected topics of current interest in theory of computation. Requisites: Requires prerequisite course of CSCI 5454 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5454 (minimum grade B). Restricted to graduate students only.", "number": "7154", "credits": "(3)", "department": "CSCI", "name": ") Topics in Theory of Computation"},
{"description": "Surveys molecular biology and combinatorial algorithms used to understand DNA, RNA, and proteins. Students work in groups to define and tackle meaningful biological problems and learn to collaborate effectively with scientists in other disciplines. Same as CSCI 4314 and MCDB 5314. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5314", "credits": "(3)", "department": "CSCI", "name": ") Algorithms for Molecular Biology"},
{"description": "Provides students with the tools to be successful technical co-founders of their own startups. We will explore the initial stages of founding a startup, including team formation, idea validation, pivoting and pitching, while employing an iterative methodology. Student teams will develop a minimum viable product, pitch their final startup concept, and be evaluated on product/market fit. CS coding concepts relevant for startups, including potentially cloud programming, mobile programming and agile software engineering, will be taught. Does not satisfy breadth requirement. Similiar to CSCI 4348. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5340", "credits": "(3)", "department": "CSCI", "name": ") Startup Essentials: Entrepreneurial Projects in Computing"},
{"description": "Examines modern techniques for analyzing and modeling the structure and dynamics of complex networks. Focuses on statistical algorithms and methods, and emphasizes model interpretability and understanding the processes that generate real data. Applications are drawn from computational biology and computational social science. No biological or social science training is required.  Recommended prereqs., CSCI 3104 and APPM 3570. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5352", "credits": "(3)", "department": "CSCI", "name": ") Network Analysis and Modeling"},
{"description": "Teaches basic exploit design and development through hands-on experimentation and testing. Uses a controlled environment to give students a \"playground\" in which to test penetration skills that are normally not allowed on live networks. Same as CSCI 4413. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5413", "credits": "(3)", "department": "CSCI", "name": ") Computer Security and Ethical Hacking"},
{"description": "Review software project management and discuss the latest approaches, methodologies and standards of software development. Learn to develop software quality, documentation, testing, and prototype goals. Study project risk management and cost estimation approaches. This course is intended for double majors doing interdisciplinary projects in other departments. Department consent required. See Senior Project Director for permission. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "number": "4338", "credits": "(2)", "department": "CSCI", "name": ") Software Project Management"},
{"description": "Provide Computer Science students with the tools to be successful technical co-founders of their own startups. We will explore the initial stages of founding a startup, including team formation, idea validation, pivoting and pitching, while employing an iterative methodology. Student teams will develop a minimum viable product, pitch their final startup concept, and be evaluated on product/market fit. Department enforced restriction: successful completion of a minimum of 36 credit hours of Computer Science coursework and approved WRTG are required to enroll. Formerly CSCI 4000. Similiar to CSCI 5340. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-). Restricted to students with 87-180 credits (Senior, Fifth Year Senior) Computer Science (CSEN) majors or Computer Science Concurrent Degree majors only.", "number": "4348", "credits": "(4)", "department": "CSCI", "name": ") Startup Essentials: Entrepreneurial Projects in Computing"},
{"description": "Teaches basic exploit design and development through hands-on experimentation and testing. Uses a controlled environment to give students a \"playground\" in which to test penetration skills that are normally not allowed on live networks. Same as CSCI 5413. Requisites: Requires prerequisite courses of CSCI 2400 and CSCI 4273 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2400 and CSCI 4273 (all minimum grade C-).", "number": "4413", "credits": "(3)", "department": "CSCI", "name": ") Computer Security and Ethical Hacking"},
{"description": "Explores chaotic dynamics theoretically and through computer simulations. Covers the standard computational and analytical tools used in nonlinear dynamics and concludes with an overview of leading-edge chaos research. Topics include time and phase-space dynamics, surfaces of section, bifurcation diagrams, fractal dimension, and Lyapunov exponents.  Recommended prereqs., PHYS 1120, CSCI 3656, and MATH 3130. Same as CSCI 5446 and ECEN 4423. Requisites: Requires prerequisite course of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 2350 or MATH 2400 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 2350 or MATH 2400 (all minimum grade C-).", "number": "4446", "credits": "(3)", "department": "CSCI", "name": ") Chaotic Dynamics"},
{"description": "Surveys artificial intelligence techniques of search, knowledge representation and reasoning, probabilistic inference, machine learning, and natural language     processing. Introduces artificial intelligence programming. Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or MATH 2001 or ECEN 2703 or APPM 3170 and one of the following:  APPM 3570, 4570, 4520, MATH 3510, 4510, CVEN 3227, ECEN 3810 or MCEN 4120 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or MATH 2001 or ECEN 2703 or APPM 3170 and one of the following:  APPM 3570, 4570, 4520, MATH 3510, 4510, CVEN 3227, ECEN 3810 or MCEN 4120 (all minimum grade C-).", "number": "3202", "credits": "(3)", "department": "CSCI", "name": ") Introduction to Artificial Intelligence"},
{"description": "Analyzes design of data systems, including data stored in file systems, database management systems and physical data organizations. Studies calculus of data models, query languages, concurrency and data privacy and security. Requisites: Requires prerequisite course of CSCI 3104 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3104 (minimum grade C-).", "number": "3287", "credits": "(3)", "department": "CSCI", "name": ") Design and Analysis of Data Systems"},
{"description": "Introduces students to fundamental concepts in autonomous, mobile robotics: mechanisms, locomotion, kinematics, control, perception and planning. The course consists of lectures and lab sessions that are geared toward developing a complex robot controller in a realistic, physics-based multi-robot simulator. Same as ECEN 3303. Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or ECEN 2703 or APPM 3170 or MATH 2001(all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or ECEN 2703 or APPM 3170 or MATH 2001(all minimum grade C-).", "number": "3302", "credits": "(3)", "department": "CSCI", "name": ") Introduction to Robotics"},
{"description": "Covers tools and practices for software development with a strong focus on best practices used in industry and professional development, such as agile methodologies, pair-programming and test-driven design. Students develop web services and applications while learning these methods and tools. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "number": "3308", "credits": "(3)", "department": "CSCI", "name": ") SoftwareDevelopment Methods and Tools"},
{"description": "Provides opportunities for independent study at the master's level.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5900", "credits": "(1-6)", "department": "CSCI", "name": ") Master's Level Independent Study"},
{"description": "Examines interdisciplinary field of human-computer interaction through a comprehensive content and historical survey. Considers new trajectories of inquiry and how the field merges with others. \"Social computing\" is emphasized as a central topic. Students across disciplines will find the course foundational for understanding human-centered technology matters, including computer scientists; social scientists; and business and media arts students. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5919", "credits": "(3)", "department": "CSCI", "name": ") HCC Survey and Synthesis: Foundations and Trajectories"},
{"description": "Studies recent advances in human-computer interaction through critical analysis of influential papers and self-guided research.  Examines new paradigms in input, output, and visualization for technology design and interaction.  Considers innovative methods to assess various population design and technological needs.  Studies in computer-related fields, social science, business, media arts, and communications benefit learning about human-centered computing research.  Recommended prereq., CSCI 5919. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5929", "credits": "(3)", "department": "CSCI", "name": ") HCC Survey and Synthesis: New Disciplinary Directions"},
{"description": "Instructs new Ph.D students in Computer Science how to obtain a Ph.D and how to become an effective member of the computer science research community. Makes students aware of formal requirements, educational objectives, and research themes. Provides evaluative criteria and guidelines for all objectives to be achieved. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "6000", "credits": "(1)", "department": "CSCI", "name": ") Introduction to the Computer Science PhD Program"},
{"description": "Topics selected by instructor. Possible topics are numerical linear algebra, solution of differential equations, nonlinear algebra and optimization, data fitting, linear and nonlinear programming, and solution of large problems. Department consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7176", "credits": "(3)", "department": "CSCI", "name": ") Topics in Numerical Computation"},
{"description": "Topics vary from year to year. Possible topics include human and machine vision, signal and speech processing, artificial life, mathematical foundations of connectionism, and computational learning theory. Recommended prereq., CSCI 5622 or instructor consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7222", "credits": "(3)", "department": "CSCI", "name": ") Topics in Nonsymbolic Artificial Intelligence"},
{"description": "Independent, interdisciplinary research project in cognitive science for graduate students pursuing a joint Ph.D in an approved core discipline and cognitive science. Projects integrate at least two areas within the cognitive sciences: psycology, computer science, linguistics, education, philosophy. Students should obtain commitments from two mentors for their project. Recommended prereqs., CSCI 7762 or EDUC 6505 or LING 7762 or PSYC 7765. Same as LING 7415, PSYC 7415, PHIL 7415, and EDUC 6506. Requisites: Requires a prerequisite course of CSCI 6402 or EDUC 6504 or LING 6200 or PHIL 6310 or PSYC 6200 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires a prerequisite course of CSCI 6402 or EDUC 6504 or LING 6200 or PHIL 6310 or PSYC 6200 (minimum grade B). Restricted to graduate students only.", "number": "7412", "credits": "(2)", "department": "CSCI", "name": ") Cognitive Science Research Practicum"},
{"description": "Independent, interdisciplinary research project in cognitive science for advanced graduate students pursuing a joint Ph.D in an approved core discipline and cognitive science. Research projects integrate at least two areas within the cognitive sciences: psychology, computer science, linguistics, education, philosophy. Students need commitments from two mentors for their project. Same as PSYC 7425, LING 7425, PHIL 7425, and EDUC 6516. Requisites: Requires a prerequisite course of LING 7415 or PSYC 7415 or CSCI 7412 or EDUC 6506 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires a prerequisite course of LING 7415 or PSYC 7415 or CSCI 7412 or EDUC 6506 (minimum grade B). Restricted to graduate students only.", "number": "7422", "credits": "(2)", "department": "CSCI", "name": ") Cognitive Science Research Practicum 2"},
{"description": "Addresses practical issues in the design, implementation and analysis of modern information retrieval systems. The major focus is on Web-based applications including ad hoc retrieval, classification, and clustering. Introduces the use of open source retrieval systems, standard evaluation metrics and gold-standard evaluation collections. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5417", "credits": "(3)", "department": "CSCI", "name": ") Information Retrieval Systems"},
{"description": "Reviews regular expressions and finite automata. Studies Turing machines and equivalent models of computation, the Chomsky hierarchy, context-free grammars, push-down automata, and computability. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5444", "credits": "(3)", "department": "CSCI", "name": ") Introduction to Theory of Computation"},
{"description": "Explores chaotic dynamics theoretically and through computer simulations. Covers the standard computational and analytical tools used in nonlinear dynamics and concludes with an overview of leading-edge chaos research. Topics include time and phase-space dynamics, surfaces of section, bifurcation diagrams, fractal dimension, and Lyapunov exponents. Same as CSCI 4446 and ECEN 5423. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5446", "credits": "(3)", "department": "CSCI", "name": ") Chaotic Dynamics"},
{"description": "An applied analysis and design class addressing the use of object-oriented techniques. Topics include domain modeling, use cases, architectural design, and modeling notations. Students apply the techniques in analysis and design projects.  Same as CSCI 5448. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-).", "number": "4448", "credits": "(3)", "department": "CSCI", "name": ") Object-Oriented Analysis and Design"},
{"description": "Introduces basic data mining concepts and techniques for discovering interesting patterns hidden in large-scale data sets, focusing on issues relating to effectiveness and efficiency. Topics covered include data preprocessing, data warehouse, association, classification, clustering, and mining specific data types such as time-series, social networks, multimedia, and Web data.  Same as CSCI 5502. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).", "number": "4502", "credits": "(3)", "department": "CSCI", "name": ") Data Mining"},
{"description": "Introduces the basic techniques used in translating programming languages: scanning, parsing, definition table management, operator identification and coercion, code selection and register allocation, error recovery. Students build a complete compiler for a simple language. Same as ECEN 4553 and CSCI 5525. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 2400 or ECEN 3350 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 2400 or ECEN 3350 (all minimum grade C-).", "number": "4555", "credits": "(3)", "department": "CSCI", "name": ") Compiler Construction"},
{"department": "CSCI", "credits": "(4)", "number": "4576", "name": ") High-Performance Scientific Computing"},
{"description": "Introduces the foundations of formal language theory, computability, and complexity. Shows relationship between automata and various classes of languages. Addresses the issue of which problems can be solved by computational means, and studies complexity of solutions. Requisites: Requires prerequisite courses of CSCI 3104 and CSCI 3155 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 3104 and CSCI 3155 (all minimum grade C-).", "number": "3434", "credits": "(3)", "department": "CSCI", "name": ") Theory of Computation"},
{"description": "Covers development, computer implementation, and analysis of numerical methods for applied mathematical problems. Topics include floating point arithmetic, numerical solution of linear systems of equations, root finding, numerical interpolation,differentiation, and integration. Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 1350 or MATH 1300 and APPM 1360 or MATH 2300 and MATH 3130 or APPM 3310 or CSCI 2820 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 1350 or MATH 1300 and APPM 1360 or MATH 2300 and MATH 3130 or APPM 3310 or CSCI 2820 (all minimum grade C-).", "number": "3656", "credits": "(3)", "department": "CSCI", "name": ") Numerical Computation"},
{"department": "CSCI", "credits": "(3)", "number": "3702", "name": ") Cognitive Science"},
{"description": "Studies methods to protect information, and the ability to process and move information, from theft, misuse, tampering, destruction, and unauthorized access. Introduces foundational topics of computer and network security, including security models, cryptopgraphy, and authentication protocols. Same as TLEN 5550. Requisites: Requires prerequisite course of CSCI 5273 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5273 (minimum grade B). Restricted to graduate students only.", "number": "6268", "credits": "(3)", "department": "CSCI", "name": ") Foundations of Computer and Network Security"},
{"description": "Introduction to automatic speech recognition and understanding, conversational agents, dialogue systems, and speech synthesis/text-to-speech. Topics include the noisy channel model, Hidden Markov Models, A* and Viterbi decoding, language modeling (N-grams, entropy), concatenative synthesis, text normalization, dialogue and conversation modeling. Recommended prereqs., CSCI 5582 or 5832, or LING 5200, or instructor consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "6302", "credits": "(3)", "department": "CSCI", "name": ") Speech Recognition and Synthesis"},
{"description": "Studies topics such as distributed databases, database interfaces, data models, database theory, and performance measurement in depth. Requisites: Requires prerequisite course of CSCI 5817 (minimum grade B). Restricted to graduate students only.", "prerequisites": "Requisites: Requires prerequisite course of CSCI 5817 (minimum grade B). Restricted to graduate students only.", "number": "7717", "credits": "(3)", "department": "CSCI", "name": ") Topics in Database Systems"},
{"description": "Reading of interdisciplinary innovative theories and methodologies of cognitive science. Students participate in the ICS Distinguished Speakers series that hosts internationally recognized cognitive scientists who share and discuss their current research. Session discussions include analysis of leading edge and controversial new approaches in cognitive science. Same as LING 7775, PSYC 7775, EDUC 7775, SLHS 7775, and PHIL 7810. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7772", "credits": "(1)", "department": "CSCI", "name": ") Topics in Cognitive Science"},
{"description": "Studies selected topics of current interest in software engineering. Department consent required. Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7818", "credits": "(3)", "department": "CSCI", "name": ") Topics in Software Engineering"},
{"description": "An applied analysis and design class addressing the use of object-oriented techniques. Topics include domain modeling, use cases, architectural design, and modeling notations. Students apply the techniques in analysis and design projects.  Same as CSCI 4448. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5448", "credits": "(3)", "department": "CSCI", "name": ") Object-Oriented Analysis and Design"},
{"description": "Techniques for algorithm design, analysis of correctness and efficiency; divide and conquer, dynamic programming, probabilistic methods, advanced data structures, graph algorithms, etc. Lower bounds, NP-completeness, intractability. Recommended prereq., CSCI 2270 or equivalent. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5454", "credits": "(3)", "department": "CSCI", "name": ") Design and Analysis of Algorithms"},
{"description": "Introduces basic data mining concepts and techniques for discovering interesting patterns hidden in large-scale data sets, focusing on issues relating to effectiveness and efficiency. Topics covered include data preprocessing, data warehouse, association, classification, clustering, and mining specific data types such as time-series, social networks, multimedia, and Web data.  Same as CSCI 4502. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5502", "credits": "(3)", "department": "CSCI", "name": ") Data Mining"},
{"description": "Introduces computing systems, software, and methods to solve large-scale problems in science and engineering. Students use high-performance workstations and a supercomputer. Second course in a two-semester sequence. Requisites: Requires prerequisite course of CSCI 4576 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 4576 (minimum grade C-).", "number": "4586", "credits": "(4)", "department": "CSCI", "name": ") High-Performance Scientific Computing 2"},
{"description": "Studies computer design at the gate level. Discusses instruction set architecture design, arithmetic and logic unit design, control logic, memory design and caches, simple pipelining,  I/O, and peripheral devices. Briefly covers aspects of modern computer architecture, such as multicore processors and cache coherence for these. Same as ECEN 4593. Requisites: Requires prerequisite course of ECEN 3350 or CSCI 2400 (minimum grade C-).  Restricted to College of Engineering majors only.", "prerequisites": "Requisites: Requires prerequisite course of ECEN 3350 or CSCI 2400 (minimum grade C-).  Restricted to College of Engineering majors only.", "number": "4593", "credits": "(3)", "department": "CSCI", "name": ") Computer Organization"},
{"description": "Presents a broad range of system measurement and modeling techniques, emphasizing applications to computer systems. Topics include system measurement, work load characterization, and analysis of data; design of experiments; simulation; and queuing theory and queuing network models. Department enforced prereq., second-semester calculus. Recommended prereq., a course in statistics. Same as CSCI 5753 and ECEN 4753/5753. Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 3753 (minimum grade C-).", "number": "4753", "credits": "(3)", "department": "CSCI", "name": ") Computer Performance Modeling"},
{"department": "CSCI", "credits": "(3)", "number": "4809", "name": ") Computer Animation"},
{"description": "Analyzes the software that extends hardware to provide a computing environment, including he role of linkers, file systems, resource sharing, security and networking. Studies the history of operating system organization and design and their influence on security, functionality and reliability. Requisites: Requires prerequisite courses of CSCI 2270 and either CSCI 2400 or ECEN 3350 (all minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite courses of CSCI 2270 and either CSCI 2400 or ECEN 3350 (all minimum grade C-).", "number": "3753", "credits": "(4)", "department": "CSCI", "name": ") Design and Analysis of Operating Systems"},
{"description": "For doctoral students.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "7900", "credits": "(1-6)", "department": "CSCI", "name": ") Doctoral Level Independent Study"},
{"description": "Investigates some specialized field of computer science. Approved and supervised by faculty members.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        Requisites: Restricted to graduate students only.", "prerequisites": "Requisites: Restricted to graduate students only.", "number": "8990", "credits": "(1-10)", "department": "CSCI", "name": ") Doctoral Dissertation"},
{"description": "Introduces the principles and techniques for compiling high-level programming languages to assembly code. Topics include parsing, instruction selection, register allocation, and compiling high-level features such as polymorphism, first-class functions, and objects. Students will build a complete compiler for a simple language. Recommended prereq., CSCI 3155 and CSCI 2400, or ECEN 2120 or ECEN 3350. Same as ECEN 5523, CSCI 4555, and ECEN 4553. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5525", "credits": "(3)", "department": "CSCI", "name": ") Compiler Construction"},
{"description": "Considers concepts common to a variety of programming languages--how they are described (both formally and informally) and how they are implemented. Provides a firm basis for comprehending new languages and gives insight into the relationship between languages and machines. Recommended prereq., CSCI 3155 or instructor consent required.  Same as ECEN 5533. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5535", "credits": "(3)", "department": "CSCI", "name": ") Fundamental Concepts of Programming Languages"},
{"description": "Applies engineering principles to phases of software product development, project planning, requirements definition, design, implementation, validation, and maintenance. Emphasizes practical methods for communicating and verifying definitions and designs---prototyping, inspections, and modeling. Includes relation to RTS and object-oriented programming. Recommended prereqs., CSCI 1300, CSCI 2270, or instructor consent required. Same as ECEN 5543. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5548", "credits": "(3)", "department": "CSCI", "name": ") Software Engineering of Standalone Programs"},
{"department": "CSCI", "credits": "(1)", "number": "4810", "name": ") Seminar in Computational Biology"},
{"description": "Covers topics of interest in computer science at the senior undergraduate level. Content varies from semester to semester.  May be repeated up to 9 total credit hours. Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).", "prerequisites": "Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).", "number": "4830", "credits": "(1-3)", "department": "CSCI", "name": ") Special Topics in Computer Science"},
{"description": "Examines a range of topics involved in using parallel operations to improve computational performance. Discusses parallel architectures, parallel algorithms and parallel programming languages. Architectures covered include vector computers, multiprocessors, network computers, and data flow machines. Department enforced prereq., background in computer organization, introduction to programming languages, elementary numerical analysis, or instructor consent. Same as ECEN 5553. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "prerequisites": "Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.", "number": "5551", "credits": "(3)", "department": "CSCI", "name": ") Parallel Processing"}
]